backend/load-tests/results/ab-metrics-peak-20260209_200401.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /actuator/metrics
Document Length:        3627 bytes

Concurrency Level:      100
Time taken for tests:   0.550 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      20125000 bytes
HTML transferred:       18135000 bytes
Requests per second:    9088.86 [#/sec] (mean)
Time per request:       11.002 [ms] (mean)
Time per request:       0.110 [ms] (mean, across all concurrent requests)
Transfer rate:          35725.26 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0      13
Processing:     0   11  11.2      9     110
Waiting:        0   10  11.2      9     110
Total:          0   11  11.2      9     110

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     12
  75%     13
  80%     15
  90%     18
  95%     23
  98%     55
  99%     70
 100%    110 (longest request)